Pandas contient les structures de données et les outils de manipulation de données conçus afin de rendre le nettoyage et l'analyse de données simples et rapides en Python. Pandas est souvent utilisé en tandem avec les packages numpy et scipy. Les packages analytiques comme statsmodels et scikit-learn et les outils de dataviz comme matplotlib. Pandas est conçu pour analyser les données tabulaires et hétérogènes. Depuis qu'il est devenu un projet open source en 2010, pandas a gagné en maturité et peut être utilisé pour un large éventail de cas d'utilisations.
La package pandas peut être importé en utilisant:

In [ ]:
import pandas as pd

Les structures de données **DataFrame** et **Series** peuvent aussi être importées en utilisant:

In [ ]:
from pandas import Series, DataFrame

# Introduction aux structures de données Pandas

Afin de pouvoir travailler avec Pandas, il faut se familiariser avec ses structures de données **Series** et **DataFrame**.

**Series**

Une **Series** est un tableau unidimensionnel contenant une séquence de valeurs et un tableau associé des libellés de données appelé **index**.
L'objet **Series** le plus simplé est formé à partir d'un tableau de données:

In [ ]:
obj = pd.Series([4, 7, -5, 3])

In [ ]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

La représentation sous forme de chaîne de caractères de **Series** affiche l'index à gauche et les valeurs à droite. Comme l'index n'a pas été spécifié, un index par défaut composé des nombres de 0 à N-1 (où N est la taille des données) est crée. On peut retrouver la représentation du tableau et celle de l'index en utilisant les attributs **values** et **index**:

In [ ]:
obj.values

array([ 4,  7, -5,  3])

In [ ]:
obj.index

RangeIndex(start=0, stop=4, step=1)

il est souvent préférable de créer Series en spécifiant l'index:

In [ ]:
obj2 = pd.Series([4, 7, -5, 2], index=['d', 'b', 'a', 'c'])

In [ ]:
obj2

d    4
b    7
a   -5
c    2
dtype: int64

In [ ]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

On peut utiliser l'index pour accéder aux différentes valeurs:

In [ ]:
obj2['a']

-5

In [ ]:
obj2['d']

4

In [ ]:
obj2[['c', 'a', 'd']]

c    2
a   -5
d    4
dtype: int64

['c', 'a', 'd'] est interprété comme étant la liste des indices même s'elle contient des strings au lieu des nombres.
L'utilisation des fonctions et les opérations telles que les filtres permet de préserver le lien avec la valeur d'index.

In [ ]:
obj2 > 0

d     True
b     True
a    False
c     True
dtype: bool

In [ ]:
obj2[obj2 > 0]

d    4
b    7
c    2
dtype: int64

In [ ]:
obj2 * 2

d     8
b    14
a   -10
c     4
dtype: int64

In [ ]:
import numpy as np

In [ ]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c       7.389056
dtype: float64

Les **Series** peuvent aussi être utilisés comme des dictionnaires ordonnés puisqu'ils mappent un index à une valeur:

In [ ]:
'b' in obj2

True

In [ ]:
'e' in obj2

False

On peut créer un objet **Series** à partir d'un dictionnaire:

In [ ]:
import numpy as np

In [ ]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000, 'Boston': np.nan}

In [ ]:
obj3 = pd.Series(sdata)

In [ ]:
obj3

Ohio      35000.0
Texas     71000.0
Oregon    16000.0
Utah       5000.0
Boston        NaN
dtype: float64

Quand on passe un dictionnaire, l'index est obtenu à partir des clés triés du dictionnaire. On peut modifier ce comportement en passant les clés dans l'ordre spécifié.

In [ ]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [ ]:
obj4 = pd.Series(sdata, index=states)

In [ ]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

Les valeurs ont été placées dans l'ordre précisé. Comme aucune valeur n'a été spécifiée pour 'California', la valeur NaN "not a number" est attribuée qui correspond à une valeur manquante pour Pandas. Les fonctions isnull et notnull sont des fonctions Pandas qui permettent de détecter les valeurs manquantes.

In [ ]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [ ]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

Les séries ont également ces méthodes:

In [ ]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

Une caractéristique des **Series** est leur capacité de s'aligner par index pour les opérations arithmétiques:

In [ ]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [ ]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [ ]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

**Series** et l'index possèdent l'attribut **name**:

In [ ]:
obj4.name = 'population'

In [ ]:
obj4.index.name = 'state'

In [ ]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

L'index peut être modifié en utilisant l'affectation:

In [ ]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [ ]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [ ]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

**DataFrame**

Un DataFrame représente une table rectangulaire de données et contient une collection ordonnée de colonnes, chacune avec un type différent (numérique, string, booléen...). Le DataFrame a un index de ligne et un autre pour les colonnes. 

Il existe plusieurs manières pour la construction d'un DataFrame, la plus commune est à partir d'un dictionnaire de listes de tailles égales.

In [ ]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [ ]:
frame = pd.DataFrame(data)

Le DataFrame résultant a l'index assigné automatiquement comme pour les Series et les colonnes sont triées.

In [ ]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

Pour les DataFrames larges, la méthode **head** retourne les 5 premières lignes.

In [ ]:
frame.head()

    state    year  pop
0    Ohio  2000.0  1.5
1    Ohio  2001.0  1.7
2    Ohio  2002.0  3.6
3  Nevada  2001.0  2.4
4  Nevada  2002.0  2.9

Si une séquence de colonnes est spécifiée, les colonnes du DataFrame seront arrangées selon l'ordre spécifié:

In [ ]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

Si une colonne non contenue dans le dictionnaire est spécifiée, elle va apparaître avec des valeurs manquantes dans le résultat:

In [ ]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], 
                      index=['one', 'two', 'three', 'four', 'five', 'six'])

In [ ]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [ ]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [ ]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

Une colonne dans un DataFrame peut être retournée comme Series en utilisant la notation dictionnaire ou par attribut:

In [ ]:
frame2['state']

       pop   state
one    1.5    Ohio
two    1.7    Ohio
three  3.6    Ohio
four   2.4  Nevada
five   2.9  Nevada
six    3.2  Nevada

In [ ]:
frame2.year

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

Les lignes peut aussi être retournées par position ou nom en utilisant l'attribut **loc**:

In [ ]:
frame2.iloc[[0, 2]]

       year state  pop debt
one    2000  Ohio  1.5  NaN
three  2002  Ohio  3.6  NaN

In [ ]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

Les colonnes peuvent être modifiées par affectation. Par exemple la colonne vide 'debt' peut être affectée en utilisant un scalaire ou un tableau de valeurs:

In [ ]:
frame2['debt'] = 16.5

In [ ]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [ ]:
frame2['debt'] = np.arange(6.)

In [ ]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

Quand on affecte une liste ou un tableau à une colonne, la longueur des valeurs doit correspondre à la longeur du DataFrame. Si une Series est affectée, ses libellés seront alignées à l'index du DataFrame en insérant les valeurs manquantes dans les trous.

In [ ]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [ ]:
frame2['debt'] = val

In [ ]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

L'affectation d'une colonne non-existante permet de créer une nouvelle colonne. Le mot clé **del** supprime des colonnes comme pour les dictionnaires.

In [ ]:
frame2['eastern'] = frame2.state == 'Ohio'

In [ ]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [ ]:
del frame2['eastern']

In [ ]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

Une autre manière pour la création d'un DataFrame est l'utilisation d'un dictionnaire de dictionnaires.

In [ ]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

Lorqu'un dictionnaire imbriqué est passé à un DataFrame, pandas interprète les clés du dictionnaire externe comme des colonnes, et les clés internes comme indices de lignes:

In [ ]:
frame3 = pd.DataFrame(pop)

In [ ]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

On peut transposer le DataFrame (échanger les lignes et les colonnes):

In [ ]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

Les clés dans les dictionnaires internes sont triées pour former l'index du résultat sauf dans le cas où un index explicite est spécifié.

In [ ]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

Les dictionnaires de Series sont traités de la même manière:

In [ ]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}

In [ ]:
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

Si l'index et columns du DataFrame ont l'attribut name spécifié, ces derniers vont être affichés:

In [ ]:
frame3.index.name = 'year'
frame3.columns.name = 'state'

In [ ]:
frame3.index

Int64Index([2001, 2002, 2000], dtype='int64')

In [ ]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [ ]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [ ]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [ ]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

Comme pour les Series, l'attribut values retourne les données contenues dans le DataFrame comme un tableau 2 dimensionnels:

In [ ]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [ ]:
print(frame3.values)

[[2.4 1.7]
 [2.9 3.6]
 [nan 1.5]]

Si les colonnes du DataFrame sont de différents types, le dtype des valeurs sera choisi pour prendre en considération toutes les colonnes.

In [ ]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

**Synthèse: Création DataFrame**

Pour synthétiser, on peut utiliser l'une de ces méthodes pour la création d'un DataFrame:

Type | Notes
-- | --
2D ndarray | Une matrice de données, passer les libellés des lignes/colonnes
Dictionnaire de listes, tuples et tableaux | Chaque séquence devient une colonne dans le DataFrame, toutes les sequences doivent avoir la même taille
Dictionnaire de Series | Chaque valeur devient une colonne, les index de chaque Series sont unifiés pour produire l'index globale
Liste de dictionnaires ou Series | Chaque élément devient une ligne dans le DataFrame, l'union des clés du dictionnaire ou les index de Series deviennent les libellés des colonnes du DataFrame
Listes de listes ou tuples | Traités comme les 2D ndarray
Un autre DataFrame | Les index du DataFrame sont utilisés sauf si une autre index est utilisée

**Objets Index**

Les objets Index de Pandas sont responsables de la maintenance des étiquettes des axes ainsi que d'autres métadonnées. Tous les tableaux ou les autres séquences d'étiquettes qu'on utilise lors de la construction de Series ou DataFrame sont convertis en Index en interne:

In [ ]:
import pandas as pd

In [ ]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [ ]:
index = obj.index

In [ ]:
index

Index(['a', 'b', 'c'], dtype='object')

In [ ]:
index[1:]

Index(['b', 'c'], dtype='object')

Les objets Index sont immutables et ne peuvent pas être modifiés en conséquence par l'utilisateur:

In [ ]:
index[1] = 'd'

TypeError: ignored

L'immutabilité des Index sécurisent le partage des Index avec les différentes structures de données.

In [ ]:
import numpy as np

In [ ]:
labels = pd.Index(np.arange(3))

In [ ]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [ ]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [ ]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [ ]:
obj2.index is labels

True

En plus d'être semblables aux tableaux **array**, une Index se comportent aussi comme les ensembles **set**:

In [ ]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [ ]:
frame3 = pd.DataFrame(pop)

In [ ]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [ ]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object')

In [ ]:
'Ohio' in frame3.columns

True

In [ ]:
frame3.index

Int64Index([2001, 2002, 2000], dtype='int64')

In [ ]:
2003 in frame3.index

False

A l'opposé des ensembles Python, une Index Pandas peut contenir des valeurs en double:

In [ ]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [ ]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

Chaque Index a un nombre de méthodes et propriétés pour la théorie des ensembles:

Méthode | Description
-- | --
append | Concaténer avec d'autres Index pour produire une nouvelle Index
difference | La différence des deux Index
intersection | L'intersection des deux Index
union | L'union des deux Index
isin | Retourne un tableau de booléens indiquant si chaque valeur est contenue dans la collection spécifiée
delete | Nouvelle Index sans l'élément à la position i
drop | Nouvelle Index sans les valeurs spécifiées
insert | Nouvelle Index avec l'élément spécifié dans la position i
is_monotonic | Retourne True si chaque élément est supérieur ou égal à l'éléments précédent
is_unique | Retourne True si l'Index n'a pas de valeurs en double
unique | Retourne l'Index sans les éléments en double

# Manipulation de Series et DataFrame

**Réindexation**

La méthode **reindex** est une méthode importante pour la manipulation des objets pandas, elle permet de créer un nouvel objet où les données sont conformes à la nouvelle Index.

In [ ]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [ ]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

La méthode reindex permet de réarranger les données selon la nouvelle Index en introduisant les valeurs manquantes si une valeur n'est pas existante.

In [ ]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [ ]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

Pour les séries chronologiques "Time Series", cette méthode permet d'interpoler ou de remplir les valeurs lors de la réindexation. Les options de la méthode le permettent en utilisant **ffill** ou "forward-fills".

In [ ]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [ ]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [ ]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

Avec les DataFrame, reindex peut modifier l'Index des lignes, des colonnes ou les deux. Si une séquence est passée, elle réindexe les lignes:

In [ ]:
import numpy as np

In [ ]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])

In [ ]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [ ]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [ ]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

Pour réindexer les colonnes, il suffit d'utiliser le paramètre columns:

In [ ]:
states = ['Texas', 'Utah', 'California']

In [ ]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

La méthode **reindex** accepte les arguments suivants:

Argument | Description
-- | --
index | La nouvelle séquence à utiliser
method | La méthode d'interpolation, ffill pour un remplissage en avant et bfill pour un remplissage en arrière
fill_value | La valeur à utiliser pour la substitution des valeurs manquantes
limit | Pour ffill et bfill, la taille maximale des valeurs à remplir
tolerance | Pour ffil et bfill, la taille maximale des valeurs à remplir pour les valeurs approximatives
level | Le niveau à prendre en considération pour les MultiIndex
copy | Copier les données même si les Index sont équivalents

**Enlever des entrées d'un axe**

La méthode drop permet de retourner un nouvel objet avec la valeur ou les valeurs spécifiées supprimées de l'axe:

In [ ]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [ ]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [ ]:
new_obj = obj.drop('c')

In [ ]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [ ]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

Avec les DataFrame, les valeurs d'index peuvent être supprimées de l'un des axes:

In [ ]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [ ]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

On peut supprimer les valeurs des colonnes en passant axis=1 ou axis='columns':

In [ ]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [ ]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

Plusieurs fonctions comme **drop** qui modifient la taille ou la forme de Series ou DataFrame peuvent manipuler un objet sur place "in-place" sans retourner l'objet:

In [ ]:
obj.drop('c', inplace=True)

In [ ]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

**Indexation, Sélection et Filtrage**

L'indexation des Series obj[...] fonctionne de la même manière que les listes et tableaux numpy avec l'exception qu'on peut utiliser n'importe quel type d'Index:

In [ ]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [ ]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [ ]:
obj['b']

1.0

In [ ]:
obj[1]

1.0

In [ ]:
obj[2:4]  # slicing

c    2.0
d    3.0
dtype: float64

In [ ]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [ ]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [ ]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

Le slicing avec les libellés est différent du slicing normal, l'extremité droite de l'intervalle est incluse:

In [ ]:
obj['b': 'c']

b    1.0
c    2.0
dtype: float64

L'affectation en utilisant ces méthodes modifie la partie correspondante des Series:

In [ ]:
obj['b': 'c'] = 5

In [ ]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

L'indexation d'un DataFrame permet de retrouver une ou plusieurs colonnes avec une seule ou plusieurs valeurs:

In [ ]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [ ]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [ ]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [ ]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [ ]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [ ]:
data[data < 5] = 0

In [ ]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

**Sélection avec loc et iloc**

Les deux opérateurs d'indexation permettent de sélectionner un sous ensemble d'enregistrements et de colonnes à partir d'un DataFrame en utilisant la notation numpy en utilisant les libellés des axes **loc** ou les entiers **iloc**.

In [ ]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [ ]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [ ]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [ ]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

Les deux fonctions utilisent le slicing en plus des libellés:

In [ ]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [ ]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

**Fonctions de sélection de données**

Type | Notes
-- | --
df[val] | Sélectionner une colonne ou une séquence de colonnes depuis le DataFrame, filtrer des lignes et slicing
df.loc[val] | Sélectionner une ligne ou un sous-ensemble de lignes à partir du DataFrame en utilisant le libellé
df.loc[:, val] |Sélectionner une colonne ou un sous-ensemble de colonnes par libellé
df.loc[val1, val2] | Sélectionner les lignes et les colonnes par libellé
df.iloc[where] | Sélectionner une ligne ou un sous-ensemble de lignes en utilisant la position
df.iloc[:, where] | Sélectionner une colonne ou un sous-ensemble de colonnes par position
df.iloc[where_i, where_j] | Sélectioner les lignes et les colonnes par position
df.at[label_i, label_j] | Sélectionner une valeur scalaire en précisant le libellé de la ligne et de la colonne
df.iat[i, j] | Sélectionner une valeur scalaire par la position de la ligne et de la colonne

**Arithmétique**

Lors des opérations arithmétiques, si les Index des objets en questions sont différents, l'Index du résultat et l'union des deux Index.

In [ ]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [ ]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=['a', 'c', 'e', 'f', 'g'])

In [ ]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [ ]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [ ]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

Dans le cas des DataFrame, l'alignement est effectué pour les lignes et les colonnes.

In [ ]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])

In [ ]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [ ]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [ ]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [ ]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

Si on ajoute deux DataFrame qui n'ont pas de libellés de lignes et de colonnes en commun, le résultat va contenir que des nulls:

In [ ]:
df1 = pd.DataFrame({'A': [1, 2]})

In [ ]:
df2 = pd.DataFrame({'B': [3, 4]})

In [ ]:
df1

   A
0  1
1  2

In [ ]:
df2

   B
0  3
1  4

In [ ]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

**Les méthodes arithmétiques avec les valeurs de remplissage**

Lors des opérations arithmétiques entre des objets indexés d'une manière différente, on peut utiliser une valeur spéciale pour le remplissage.

In [ ]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))

In [ ]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))

In [ ]:
df2.loc[1, 'b'] = np.nan

In [ ]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [ ]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [ ]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [ ]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [ ]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [ ]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

Les méthodes arithmétiques:

Méthode | Description
-- | --
add, radd | Méthodes pour l'addition
sub, rsub | Méthodes pour la soustraction
div, rdiv | Méthodes pour la division
floordiv, rfloordiv | Méthodes pour la division entière
mul, rmul | Méthodes pour la multiplication (*)
pow, rpow | Méthodes pour la puissance (**)

In [4]:
import pandas as pd

import numpy as np

In [11]:
df1 = pd.DataFrame(np.arange(1, 5).reshape(2, 2), columns=list('ab'))

In [12]:
df1

   a  b
0  1  2
1  3  4

In [15]:
df2 = pd.DataFrame(np.arange(1, 8, 2).reshape(2, 2), columns=list('ab'))

In [16]:
df2

   a  b
0  1  3
1  5  7

In [17]:
df2 / 1

     a    b
0  1.0  3.0
1  5.0  7.0

In [18]:
1 / df2

     a         b
0  1.0  0.333333
1  0.2  0.142857

In [19]:
df2.div(1)

     a    b
0  1.0  3.0
1  5.0  7.0

In [22]:
1 / df2

     a         b
0  1.0  0.333333
1  0.2  0.142857

In [21]:
df2.rdiv(1)

     a         b
0  1.0  0.333333
1  0.2  0.142857

**Opérations entre DataFrame et Series**

Les opérations arithmétiques entre un DataFrame et une Series sont aussi bien définies:

In [25]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [26]:
series = frame.iloc[0]

In [ ]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [ ]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [ ]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

Si une valeur d'index n'est pas trouvée dans le DataFrame ou le Series, les deux objets vont être réindexés pour former l'union:

In [24]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [ ]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

Si on peut propager "broadcasting" les valeurs selon les colonnes:

In [28]:
series3 = frame['d']

In [29]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [30]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [35]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

**Mapping**

On peut appliquer une fonction à l'ensemble des éléments d'un DataFrame:

In [37]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [38]:
frame

               b         d         e
Utah    0.765126 -0.255286  0.234465
Ohio    0.889986  0.029849  0.168442
Texas   1.536293  1.158244 -1.293698
Oregon -0.976465 -1.649021 -1.053667

In [39]:
np.abs(frame)

               b         d         e
Utah    0.765126  0.255286  0.234465
Ohio    0.889986  0.029849  0.168442
Texas   1.536293  1.158244  1.293698
Oregon  0.976465  1.649021  1.053667

La méthode **apply** permet d'appliquer une fonction à un tableau de valeurs:

In [40]:
f = lambda x: x.max() - x.min()

L'expression lambda précédente est équivalente à la fonction suivante:

In [41]:
def f(x):
  return x.max() - x.min()

In [42]:
frame.apply(f)

b    2.512758
d    2.807265
e    1.528163
dtype: float64

Comment on peut spécifier l'expression lambda directement à l'intérieur des fonctions qui acceptent des fonctions comme paramètres.

In [43]:
frame.apply(lambda x: x.max() - x.min())

b    2.512758
d    2.807265
e    1.528163
dtype: float64

On peut utiliser apply par exemple afin de normaliser ou de standariser notre dataset. Ces traitements sont souvent obligatoires pour certains algorithmes afin de mettre en placer un modèle de données convenable.

Si on passe axis='columns', la fonction sera invoquée par ligne;

Exemple: Conversion d'une colonne contenant le montant de la devise $ vers €:

In [48]:
df = np.abs(1000 * pd.DataFrame(np.random.randn(1000000).reshape(-1, 2), columns=['Montant HT', 'Montant TTC']))

In [49]:
df

         Montant HT  Montant TTC
0       1460.226587  1022.245191
1        346.615111     7.545099
2        157.753711   593.524647
3        293.427352    16.808813
4       1099.932359   391.195252
...             ...          ...
499995   369.882556  1185.388858
499996   355.977495   400.903623
499997  1612.745264   672.448898
499998    89.704334   319.477214
499999   244.598117    73.043810

[500000 rows x 2 columns]

Pour convertir les montants du $ vers le €:

In [50]:
TAUX_CHANGE = 1.19

In [99]:
x = df[['Montant HT']]

In [100]:
x

         Montant HT
0       1460.226587
1        346.615111
2        157.753711
3        293.427352
4       1099.932359
...             ...
499995   369.882556
499996   355.977495
499997  1612.745264
499998    89.704334
499999   244.598117

[500000 rows x 1 columns]

In [53]:
df.apply(lambda x: x / TAUX_CHANGE)

         Montant HT  Montant TTC
0       1227.081166   859.029573
1        291.273202     6.340420
2        132.566144   498.760207
3        246.577606    14.125053
4        924.312907   328.735506
...             ...          ...
499995   310.825678   996.125090
499996   299.140752   336.893801
499997  1355.248121   565.083108
499998    75.381793   268.468247
499999   205.544636    61.381353

[500000 rows x 2 columns]

**Afficher les montant HT minimal et maximal**

In [86]:
f = lambda x: (x.min(), x.max(), x.mean())

In [87]:
type(df['Montant HT'])

pandas.core.series.Series

In [92]:
type(df[['Montant HT']])

pandas.core.frame.DataFrame

In [137]:
df[['Montant HT']].apply(f, axis=1)

0         (1460.2265873475346, 1460.2265873475346, 1460....
1         (346.6151106638519, 346.6151106638519, 346.615...
2         (157.75371117847752, 157.75371117847752, 157.7...
3         (293.4273516905907, 293.4273516905907, 293.427...
4         (1099.9323591324178, 1099.9323591324178, 1099....
                                ...
499995    (369.8825563578859, 369.8825563578859, 369.882...
499996    (355.9774952921862, 355.9774952921862, 355.977...
499997    (1612.7452635851078, 1612.7452635851078, 1612....
499998    (89.70433418808103, 89.70433418808103, 89.7043...
499999    (244.5981171520703, 244.5981171520703, 244.598...
Length: 500000, dtype: object

La commande magique "Magic Command" %timeit de IPython/Jupyter permet de nous donner une idée sur l'exécution d'une commande: le temps nécessaire pour compléter l'opération.

In [138]:
%timeit df[['Montant HT']].apply(f, axis=1)

1 loop, best of 3: 46.2 s per loop

In [136]:
frame.apply(f, axis='columns')

Utah      (-0.2552860374281795, 0.765126419041117, 0.248...
Ohio      (0.029849496917487218, 0.8899861810242078, 0.3...
Texas     (-1.2936979029343432, 1.5362927155519612, 0.46...
Oregon    (-1.6490214523953632, -0.9764650847051042, -1....
dtype: object

On peut également retourner des Series:

In [ ]:
def f(x):
  return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [ ]:
frame.apply(f)

           b         d         e
min -2.80659 -1.001692 -1.069871
max  1.59574  1.554453  0.751681

On peut également utiliser les fonctions "element-wise":

In [96]:
format = lambda x: '%5.3f' % x

In [97]:
frame

               b         d         e
Utah    0.765126 -0.255286  0.234465
Ohio    0.889986  0.029849  0.168442
Texas   1.536293  1.158244 -1.293698
Oregon -0.976465 -1.649021 -1.053667

In [98]:
frame.applymap(format)

             b       d       e
Utah     0.765  -0.255   0.234
Ohio     0.890   0.030   0.168
Texas    1.536   1.158  -1.294
Oregon  -0.976  -1.649  -1.054

**Tri et classement**

Le tri d'un jeux de données en utilisant certains critères est important, la méthode sort_index permet de trier d'une manière lexicographique par indexe de ligne ou de colonne:

In [ ]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [ ]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

Pour un DataFrame, le tri peut être effectué selon un axe précis:

In [ ]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])

In [ ]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [ ]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [ ]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

Pour trier une Series par valeurs, on peut utiliser sort_values:

In [ ]:
obj = pd.Series([4, 7, -3, 2])

In [ ]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

Les valeurs manquantes sont triés à la fin:

In [ ]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [ ]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

Pour les DataFrame, on peut utiliser une ou plusieurs colonnes comme clés de tri:

In [ ]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [ ]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [ ]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [ ]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

Le classement assigne des valeurs de 1 jusqu'au nombre d'éléments:

In [ ]:
obj = pd.Series(7, -5, 7, 4, 2, 0, 4])

In [160]:
notes = pd.DataFrame(pd.DataFrame({'Jeff': {'note': 13}, 'Alex': {'note': 10}, 'Manon': {'note': 18}, 'Willy': {'note': 20}, 'Smith': {'note': 10}}).T, columns=['note'])

In [161]:
notes

       note
Jeff     13
Alex     10
Manon    18
Willy    20
Smith    10

In [162]:
notes.rank?

In [167]:
notes['rank'] = notes.rank(method='min', ascending=False)

In [168]:
notes

       note  rank
Jeff     13   3.0
Alex     10   4.0
Manon    18   2.0
Willy    20   1.0
Smith    10   4.0

Méthode | Description
-- | --
average | affecte la moyenne à chaque entrée des groupes égaux
min | utilise le min pour l'ensemble du groupe
max | utilise le max pour l'ensemble du groupe
first | affecte le classement selon l'ordre dont lequel les données apparaissent
dense | comme la méthode min mais le classement s'incrémente de 1 entre les groupes

In [ ]:
names = ['Alexandra', 'Jennifer', 'Kim']

In [ ]:
for name in names:
  print(name)

Alexandra
Jennifer
Kim

In [ ]:
for i in range(3):
  print(i, names[i])

0 Alexandra
1 Jennifer
2 Kim

In [ ]:
[(i, name) for i, name in enumerate(names)]

[(0, 'Alexandra'), (1, 'Jennifer'), (2, 'Kim')]

# Statistiques descriptives

Méthode | Description
-- | --
count | Le nombre de valeurs non manquantes
describe | Un sommaire de statistiques pour chaque Series ou le DataFrame
min, max | Le minimum et le maximum
argmin, argmax | L'indice de la valeur minimale/maximale
idxmin, idxmax | L'étiquette des lignes contenant la valeur minimale/maximale
quantile | 
sum | Somme des valeurs
median | La valeur médiane
mad | mean absolute deviation: La déviation moyenne absolue
prod | Le produit de toutes les valeurs
var | La variance des valeurs
std | L'écart type: standard deviation
skew | skewness: symétrie
kurt | kurtosis: applatissement
cumsum | La somme cumulative
cummin, cummax | Le minimum/maximum cumulatif
cumprod | Le produit cumulatif
pct_change | Changement de pourcentage